import math

# Задаем константы из таблицы
a = 2.0
b = 3.0
c = 4.0

# Ввод значения x с клавиатуры
x_input = input("Введите значение x (для проверки из таблицы введите 1): ")
x = float(x_input)

# Вычисляем значение функции y
# math.fabs() - модуль, ** - возведение в степень, math.sqrt() - корень
y = (a * math.fabs(x**3 - b)) / math.sqrt(x**2 + c) + 0.75 * (math.sin(x)**2)

# Вывод результатов на экран
print("\n--- Результаты расчетов ---")
print("Введенное значение x =", x)
print("Рассчитанное значение функции y =", y)